{
    "interns": [
        {
            "name": "National Supercomputing Center in Jinan",
            "logo_1x": "../../assets/nsccjn-480.png",
            "logo_2x": "../../assets/nsccjn.png",
            "duration": "Jun 2024 - Aug 2024",
            "position": "Algorithms and data analyst",
            "description": "- <div class='bold'>Cleaned</div> time series device data; constructed data anomaly detection and localization algorithms to locate and process abnormal data data using <div class='bold'>Huber Regressor</div> in <div class='bold'>robust regression</div>.\n- Built <div class='bold'>ICC (Intraclass Correlation)</div> data consistency check algorithms, made judgment of consistency on the historical data of multiple related devices.\n- Built machine learning <div class='bold'>ARIMA (Autoregressive Integrated Moving Average)</div> model, used the constructed ARIMA model to forecast the <div class='bold'>time series</div> device data.\n- Wrote Python automation script for timed processing of device data, handled timed database read/write using <div class='bold'>PyMySQL</div>, and processed the retrieved device data from MySQL database."
        },

        {
            "name": "China Merchants Securities Co. Ltd",
            "logo_1x": "../../assets/cms-480.jpg",
            "logo_2x": "../../assets/cms.png",
            "duration": "Jul 2024 - Aug 2024",
            "position": "Wealth management consultant",
            "description": "- Learned professional knowledge of business and finance, such as brokerage business, capital intermediary business as well as professional concepts such as structured deposit, risk level, etc.\n- Examined the operating principles of the securities market, investigated the management structure, service processes and operating models of securities companies.\n- Deep-mined, organized, screened and analyzed public fund data based on <div class='bold'>volatility</div>, <div class='bold'>maximum retracement</div>, <div class='bold'>Sharpe ratio</div>, <div class='bold'>downside risk</div>, etc."
        }

    ]
}